# DataFrame part2

In [7]:
import numpy as np
import pandas as pd

In [8]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [9]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [10]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [11]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [12]:
df=pd.DataFrame(np.random.randint(0,50,12).reshape(6,2),hier_index,['A','B'])

In [16]:
df

       A   B
G1 1  42  10
   2  12  48
   3  28  14
G2 1  38  14
   2   2  33
   3  39   9

In [17]:
df.loc['G1']

    A   B
1  42  10
2  12  48
3  28  14

In [29]:
df.loc['G1'].loc[3]

A    28
B    14
Name: 3, dtype: int32

In [30]:
df['A']

Groups  Numbers
G1      1          42
        2          12
        3          28
G2      1          38
        2           2
        3          39
Name: A, dtype: int32

In [31]:
df.index.names

FrozenList(['Groups', 'Numbers'])

In [32]:
df.index.names=['Groups','Numbers'] ##setting index

In [34]:
df

                 A   B
Groups Numbers
G1     1        42  10
       2        12  48
       3        28  14
G2     1        38  14
       2         2  33
       3        39   9

In [35]:
df.loc['G2'].loc[2]['B']

33

In [36]:
df.loc['G1'].loc[3]['A']

28

# cross-section of rows and column getting

In [37]:
df

                 A   B
Groups Numbers
G1     1        42  10
       2        12  48
       3        28  14
G2     1        38  14
       2         2  33
       3        39   9

In [40]:
df.loc['G1']

          A   B
Numbers
1        42  10
2        12  48
3        28  14

In [41]:
df.xs('G1')

          A   B
Numbers
1        42  10
2        12  48
3        28  14

# inoder to get all values of 1 from G1 AND G2

In [45]:
df.xs(3,level='Numbers') ##using crossection

         A   B
Groups
G1      28  14
G2      39   9